import Image from 'next/image'

export default function GroupPage() {
	return (
		<>
			<div className="text-b1-medium text-orange">메인 화면으로 돌아가기</div>
			<div className="flex flex-1 flex-col items-center gap-6 py-6">
				<h2 className="text-h2-bold">모두와 함께 음식 정하기</h2>
				<article className="mb-6 flex w-[640px] flex-1 flex-col">
					<strong className="text-b1-bold">최근 생성된 그룹방</strong>

					<div className="flex flex-col items-center">
						<Image
							src="/assets/images/groupVote-blank-babbuddy.webp"
							alt="밥버디 캐릭터"
							width={442}
							height={262}
							className="my-12"
						/>
						<div className="flex flex-col items-center gap-2">
							<p className="text-b1-medium">그룹방이 텅 비었어요 새로운 방을 생성해보세요</p>
							<span className="text-caption-medium text-gray-30 flex cursor-pointer items-center gap-2">
								<svg
									xmlns="http://www.w3.org/2000/svg"
									width="25"
									height="24"
									viewBox="0 0 25 24"
									fill="none"
								>
									<path
										d="M12.5 17C12.7833 17 13.021 16.904 13.213 16.712C13.405 16.52 13.5007 16.2827 13.5 16V12C13.5 11.7167 13.404 11.4793 13.212 11.288C13.02 11.0967 12.7827 11.0007 12.5 11C12.2173 10.9993 11.98 11.0953 11.788 11.288C11.596 11.4807 11.5 11.718 11.5 12V16C11.5 16.2833 11.596 16.521 11.788 16.713C11.98 16.905 12.2173 17.0007 12.5 17ZM12.5 9C12.7833 9 13.021 8.904 13.213 8.712C13.405 8.52 13.5007 8.28267 13.5 8C13.4993 7.71733 13.4033 7.48 13.212 7.288C13.0207 7.096 12.7833 7 12.5 7C12.2167 7 11.9793 7.096 11.788 7.288C11.5967 7.48 11.5007 7.71733 11.5 8C11.4993 8.28267 11.5953 8.52033 11.788 8.713C11.9807 8.90567 12.218 9.00133 12.5 9ZM12.5 22C11.1167 22 9.81667 21.7373 8.6 21.212C7.38334 20.6867 6.325 19.9743 5.425 19.075C4.525 18.1757 3.81267 17.1173 3.288 15.9C2.76333 14.6827 2.50067 13.3827 2.5 12C2.49933 10.6173 2.762 9.31733 3.288 8.1C3.814 6.88267 4.52633 5.82433 5.425 4.925C6.32367 4.02567 7.382 3.31333 8.6 2.788C9.818 2.26267 11.118 2 12.5 2C13.882 2 15.182 2.26267 16.4 2.788C17.618 3.31333 18.6763 4.02567 19.575 4.925C20.4737 5.82433 21.1863 6.88267 21.713 8.1C22.2397 9.31733 22.502 10.6173 22.5 12C22.498 13.3827 22.2353 14.6827 21.712 15.9C21.1887 17.1173 20.4763 18.1757 19.575 19.075C18.6737 19.9743 17.6153 20.687 16.4 21.213C15.1847 21.739 13.8847 22.0013 12.5 22ZM12.5 20C14.7333 20 16.625 19.225 18.175 17.675C19.725 16.125 20.5 14.2333 20.5 12C20.5 9.76667 19.725 7.875 18.175 6.325C16.625 4.775 14.7333 4 12.5 4C10.2667 4 8.375 4.775 6.825 6.325C5.275 7.875 4.5 9.76667 4.5 12C4.5 14.2333 5.275 16.125 6.825 17.675C8.375 19.225 10.2667 20 12.5 20Z"
										fill="#AEAEAE"
									/>
								</svg>
								모두와 함께 메뉴 정하기 가이드
							</span>
						</div>
					</div>
				</article>

				<button
					type="button"
					className="bg-orange text-h3-medium flex w-[640px] flex-1 justify-center rounded-3xl px-9 py-4 text-white"
				>
					새 그룹 만들기
				</button>
			</div>
		</>
	)
}
